Pejosek/STM32_GPS/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart1_tx;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart2_tx;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
uint8_t Received[300];
uint8_t Buffor[200];
uint8_t Wynik[200];
uint8_t Wynik2[200];
uint8_t Wynik3[200];
uint8_t Transmit[90];
uint8_t *p = Received;
uint8_t Srednia[10];

//wzorzec czego szukam do funkcji
uint8_t Wzorzec_GNGLL[5] = "GNGLL";
uint8_t Wzorzec_GNGGA[5] = "GNGGA";
uint8_t Wzorzec_GNVTG[5] = "GNVTG";

//Tablica do sredniej
uint8_t Tablica_srednia[10] = {0};
uint8_t index = 0;

uint8_t Test0[200];
uint8_t Test1[200] = "1dfgdfg$GNGLL,5423.47883,N,01836.97981,E,202636.00,A,A*76dfgdbdfb";
uint8_t Test3[200] = "1231$GNGLL,542,123";
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
//int filtrowanie(uint8_t *buffor, int nr_parametru);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	HAL_UART_Receive_DMA(&huart1, Received, 300);
	sprintf(Transmit,"%s\n",Received);
	HAL_UART_Transmit_IT(&huart1, Transmit, strlen(Transmit));

	/*int par = filtrowanie(Received,1,Wynik,Wzorzec_GNGGA);
	  //int par = 1;
	  switch(par){
	   case 0:
		 sprintf(Test0,"%s\n\r",Wynik);
	  	 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
	  	 break;
	   case 1:
		 sprintf(Test0,"%s\n\r","brak $");
		 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
		 break;
	   case 2:
		 sprintf(Test0,"%s\n\r","skladnia");
		 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
		 break;
	   case 3:
		 sprintf(Test0,"%s\n\r","pusty");
		 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
		 break;
	   default:
		 sprintf(Test0,"%s\n\r","error");
		 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
		 break;
	  }*/
	//HAL_UART_Transmit_IT(&huart1, Transmit, 90);
	//HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15, GPIO_PIN_SET);
	HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
}
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */
  HAL_UART_Receive_IT(&huart1, Received, 300);
  /* USER CODE END 2 */
  //sprintf(Test0,"%s\n\r",Test1);
  //HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
  //HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));

  /*int par = filtrowanie(Test1,1,Wynik,Wzorzec_GNGGA);
  //int par = 1;
  switch(par){
   case 0:
	 sprintf(Test0,"%s\n\r",Wynik);
  	 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
  	 break;
   case 1:
	 sprintf(Test0,"%s\n\r","brak $");
	 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
	 break;
   case 2:
	 sprintf(Test0,"%s\n\r","skladnia");
	 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
	 break;
   case 3:
	 sprintf(Test0,"%s\n\r","pusty");
	 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
	 break;
   default:
	 sprintf(Test0,"%s\n\r","error");
	 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
	 break;
  }*/
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */
	/*  if(strlen(Received)>0){
		int par = filtrowanie(Received,1,Wynik,Wzorzec_GNGLL);
		filtrowanie(Received,3,Wynik2,Wzorzec_GNGLL);
		filtrowanie(Received,7,Wynik3,Wzorzec_GNVTG);
		if(par == 0){
		  switch(par){
		   case 0:
			 //sprintf(Test0, "%s\n\n\r", Received);
			 //HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
			 if((strlen(Wynik) == 9) && (strlen(Wynik2) == 10) && (strlen(Wynik3) == 4)){
				 sprintf(Test0,"%s %s %s\n\r",Wynik, Wynik2, Wynik3);//tutaj wstawic Wynik
				 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
				 Received[0] = '\0';
			 }
		  	 break;
		   case 1:
			 sprintf(Test0,"%s\n\r","brak $");
			 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
			 break;
		   case 2:
			 sprintf(Test0,"%s\n\r","skladnia");
			 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
			 break;
		   case 3:
			 sprintf(Test0,"%s\n\r","pusty");
			 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
			 break;
		   default:
			 sprintf(Test0,"%s\n\r","error");
			 HAL_UART_Transmit_IT(&huart1, Test0, strlen(Test0));
			 break;
		  }
		}
	  }*/
  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 100;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USART1 init function */
static void MX_USART1_UART_Init(void)
{

  huart1.Instance = USART1;
  huart1.Init.BaudRate = 9600;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/* USART2 init function */
static void MX_USART2_UART_Init(void)
{

  huart2.Instance = USART2;
  huart2.Init.BaudRate = 9600;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/** 
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void) 
{
  /* DMA controller clock enable */
  __HAL_RCC_DMA2_CLK_ENABLE();
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Stream5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);
  /* DMA1_Stream6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);
  /* DMA2_Stream2_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Stream2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA2_Stream2_IRQn);
  /* DMA2_Stream7_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15, GPIO_PIN_RESET);

  /*Configure GPIO pins : PD12 PD13 PD14 PD15 */
  GPIO_InitStruct.Pin = GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */


int filtrowanie(uint8_t *buf, int nr_parametru, uint8_t *wynik_lokalny, uint8_t *wzorzec)
{
	int i = 0;

	while((*buf != '$') && (i<200)){
		buf++;
		i++;
	}
	if (i>=200){
		return 1; //nie ma $
	}
	buf++;
	if(*buf != *(wzorzec+0)){
		return 2; // blad skladni
	}
	buf++;
	if(*buf != *(wzorzec+1)){
			return 2; // blad skladni
	}
	buf++;
	if(*buf != *(wzorzec+2)){
		return 2; // blad skladni
	}
	buf++;
	if(*buf != *(wzorzec+3)){
		return 2; // blad skladni
	}
	buf++;
	if(*buf != *(wzorzec+4)){
		return 2; // blad skladni
	}
	buf++;
	if(*buf != ','){
		return 2; // blad skladni
	}
	buf++;
	for (int j = 0; j < nr_parametru - 1; j++){
		while(*buf != ','){
			buf++;
		}
		buf++;
	}
	if(*buf == ','){
		*wynik_lokalny = '\0';
		return 3;
	}
	while(*buf != ','){
		if(*buf != '.'){
			*wynik_lokalny = *buf;
			wynik_lokalny++;
			buf++;
		} else {
			buf++;
		}
	}
	*wynik_lokalny = '\0';
	return 0;
}

/*int dodaj_pomiar(int *tab, int *nowy, uint8_t *wynik){
	if(index<9){
		tab[index] = nowy;
		index++;
		if(index == 0){
			wynik
		}
	} else {
		index = 0;
		tab[index] = nowy;
	}
}*/
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
